In [1]:
import pandas as pd
import numpy as np
from sklearn import svm

In [2]:
df_train = pd.read_csv('train.csv', index_col='PassengerId')
df_test = pd.read_csv('test.csv', index_col='PassengerId')
df_gender = pd.read_csv('gender_submission.csv', index_col='PassengerId')

In [3]:
df_train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [5]:
df_train.Cabin.value_counts()

B96 B98        4
G6             4
C23 C25 C27    4
C22 C26        3
F33            3
              ..
E34            1
C7             1
C54            1
E36            1
C148           1
Name: Cabin, Length: 147, dtype: int64

In [6]:
df_train.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [7]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Name      418 non-null    object
 2   Sex       418 non-null    object
 3   Age       332 non-null    float64
 4   SibSp     418 non-null    int64
 5   Parch     418 non-null    int64
 6   Ticket    418 non-null    object
 7   Fare      417 non-null    float64
 8   Cabin     91 non-null     object
 9   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(5)
memory usage: 35.9+ KB

In [8]:
df_train = df_train.drop('Cabin', axis=1)
df_test = df_test.drop('Cabin', axis=1)

In [9]:
df_train.Fare.value_counts()

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
35.0000     1
28.5000     1
6.2375      1
14.0000     1
10.5167     1
Name: Fare, Length: 248, dtype: int64

In [10]:
df_train[['Pclass','Fare']]

             Pclass     Fare
PassengerId
1                 3   7.2500
2                 1  71.2833
3                 3   7.9250
4                 1  53.1000
5                 3   8.0500
...             ...      ...
887               2  13.0000
888               1  30.0000
889               3  23.4500
890               1  30.0000
891               3   7.7500

[891 rows x 2 columns]

In [11]:
df_train[df_train['Pclass']==1]['Fare'].describe()

count    216.000000
mean      84.154687
std       78.380373
min        0.000000
25%       30.923950
50%       60.287500
75%       93.500000
max      512.329200
Name: Fare, dtype: float64

In [12]:
df_train[df_train['Pclass']==2]['Fare'].describe()

count    184.000000
mean      20.662183
std       13.417399
min        0.000000
25%       13.000000
50%       14.250000
75%       26.000000
max       73.500000
Name: Fare, dtype: float64

In [13]:
df_train[df_train['Pclass']==3]['Fare'].describe()

count    491.000000
mean      13.675550
std       11.778142
min        0.000000
25%        7.750000
50%        8.050000
75%       15.500000
max       69.550000
Name: Fare, dtype: float64

In [14]:
df_test.loc[(df_test['Fare'].isnull()), ['Fare']] = df_train[df_train['Pclass']==3]['Fare'].median()

In [15]:
df_test.Sex.value_counts()

male      266
female    152
Name: Sex, dtype: int64

In [16]:
df_train[df_train['Pclass']==1]['Age'].describe()

count    186.000000
mean      38.233441
std       14.802856
min        0.920000
25%       27.000000
50%       37.000000
75%       49.000000
max       80.000000
Name: Age, dtype: float64

In [17]:
df_train[df_train['Pclass']==2]['Age'].describe()

count    173.000000
mean      29.877630
std       14.001077
min        0.670000
25%       23.000000
50%       29.000000
75%       36.000000
max       70.000000
Name: Age, dtype: float64

In [18]:
df_train[df_train['Pclass']==3]['Age'].describe()

count    355.000000
mean      25.140620
std       12.495398
min        0.420000
25%       18.000000
50%       24.000000
75%       32.000000
max       74.000000
Name: Age, dtype: float64

In [19]:
df_train.loc[(df_train['Age'].isnull()) & (df_train['Pclass']==1),['Age']] = 37.
df_train.loc[(df_train['Age'].isnull()) & (df_train['Pclass']==2),['Age']] = 29.
df_train.loc[(df_train['Age'].isnull()) & (df_train['Pclass']==3),['Age']] = 24.

In [20]:
df_train[df_train.Embarked.isnull()]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
PassengerId,,,,,,,,,,
62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,NaN
830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,NaN

In [21]:
df_train.loc[(df_train.Ticket=='113572'),['Embarked']] = 'S'

In [22]:
df_train.Sex = df_train.Sex.map({'male':0, 'female':1})

In [23]:
df_train.Embarked = df_train.Embarked.map({'S':0, 'C':1, 'Q':2})

In [24]:
df_test.loc[(df_test['Age'].isnull()) & (df_test['Pclass']==1),['Age']] = 37.
df_test.loc[(df_test['Age'].isnull()) & (df_test['Pclass']==2),['Age']] = 29.
df_test.loc[(df_test['Age'].isnull()) & (df_test['Pclass']==3),['Age']] = 24.

In [25]:
df_train.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Embarked'],
      dtype='object')

In [26]:
y_train = df_train.Survived
X_train = df_train.drop(['Survived','Name', 'Ticket'], axis=1)

In [27]:
clf = svm.LinearSVC()
clf.fit(X_train,y_train)

C:\Users\rshir\anaconda3\lib\site-packages\sklearn\svm\_base.py:1206: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  warnings.warn(

LinearSVC()

In [28]:
clf.score(X_train,y_train)

0.7362514029180696

In [29]:
df_test.Embarked = df_test.Embarked.map({'S':0, 'C':1, 'Q':2}) 
df_test.Sex = df_test.Sex.map({'male':0, 'female':1})

In [33]:
clf.score(df_test.drop(['Name','Ticket'], axis=1),df_gender)

0.8947368421052632